reddit_lite/app/controllers/posts_controller.rb

INSERT INTO "post_subs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 1], ["post_id", 5], ["created_at", "2018-11-21 01:00:20.125353"], ["updated_at", "2018-11-21 01:00:20.125353"]]
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @subs = Sub.all
    @post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "puh ohhh"], ["updated_at", "2018-11-21 01:20:52.930826"], ["id", 5]]
---
  def update

    @post = Post.find(params[:id])
    redirect_to post_url(@post) unless current_user == @post.author
    if @post.update(post_params)