reddit_lite/app/views/subs/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
<h1> <%= @sub.title %> </h1>
<h3>Moderated By: <%= User.find(@sub.moderator_id).username %> </h3>