reddit_lite/app/models/user.rb

  def reset_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "manhh7cvOExnZtQuT0v22A"], ["updated_at", "2018-11-20 20:08:58.173386"], ["id", 1]]